0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.9641 0 0);

boundaryField
{
    my-velocity-inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.9641 0 0);
    }

    my-pressure-outlet
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    frontPlanes
    {
        type            cyclic;
    }
    
    backPlanes
    {
        type            cyclic;
    }

    freeSurf
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
