0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0465e-6;

boundaryField
{
    my-velocity-inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    my-pressure-outlet
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            fixedValue;
        value           uniform 0.000000001;
    }

    frontPlanes
    {
        type            cyclic;
    }

    backPlanes
    {
        type            cyclic;
    }

    freeSurf
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
